namespace ZCN.NET.CommonX.Enums
{
    /// <summary>
    /// Guid 格式
    /// </summary>
    public enum GuidFormat
    {
        /// <summary>
        /// 32位数：00000000000000000000000000000000
        /// </summary>
        N,

        /// <summary>
        /// 32的数字，由连字符分隔：00000000-0000-0000-0000-000000000000
        /// </summary>
        D,

        /// <summary>
        /// 32位，用连字符隔开，括在大括号中：{00000000-0000-0000-0000-000000000000}
        /// </summary>
        B,

        /// <summary>
        /// 32位，用连字符隔开，括在括号中：(00000000-0000-0000-0000-000000000000)
        /// </summary>
        P,

        /// <summary>
        /// 括在大括号中的四个十六进制值，其中第四个值是八个十六进制值的子集（也括在大括号中）：{0x00000000，0x0000，0x0000，{0x00，0x00，0x00，0x00，0x00，0x00，0x00，0x00}}
        /// </summary>
        X
    }
}